/**************************************************************************************
 *
 * 文件描述：功能选项头文件。
 * 创建日期：
 *
 * 备注：
 *
 **************************************************************************************
 */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __FUN_OPT_H
#define __FUN_OPT_H

/* Includes ------------------------------------------------------------------*/


/* Exported_Macros -----------------------------------------------------------*/
/* 软件模拟I2C接口使能选项 ***************** */
#define OPT_SW_I2C_EN                     1

/* 使能/关闭测试引脚功能 PC14-->TEST_PIN1、 PC15-->TEST_PIN2 */
#define OPT_TEST_PIN_ENABLE               1

/* 外部插电自动化测试功能选项 */
#define OPT_EXT_POWER_AUTO_SW_TEST_ENABLE         0

/* 系统错误信息打印功能使能选项 */
#define OPT_SYS_ERR_PRINT_EN								1

/* Exported_Types ------------------------------------------------------------*/



/* Exported_Variables --------------------------------------------------------*/



/* Exported_Functions --------------------------------------------------------*/


























#endif
