/*================================================================================*
 * Copyright(c) 2015-2017, Autel Intelligent Technology Corp., Ltd
 * All rights reserved
 *================================================================================*
 *
 * 文件名称: Test_task.c
 *
 * 文件描述: 测试
 * 作    者:
 * 创建时间:
 * 文件版本:
 * 修改历史:
 *
 *================================================================================*/

/*================================================================================*
 *                                 头文件包含                                     *
 *================================================================================*/
#include "includes.h"
#include "stdlib.h"
#include "test_task.h"

/*================================================================================*
 *                                   宏定义                                       *
 *================================================================================*/
//#define USE_WRITE_ARRAY1
/*================================================================================*
 *                                全局变量定义                                    *
 *================================================================================*/
uint8_t nTestTaskID;

#define USE_WRITE_ARRAY1
/*================================================================================*
 *                               局部变量定义                                     *
 *================================================================================*/


//void Test_Flash_Write(void)
//{
//	STMFLASH_Erase_NPage(FLASH_TEST_ADDR, 4);
//	
//	#ifdef USE_WRITE_ARRAY1
//	STMFLASH_Write_NBytes(FLASH_TEST_ADDR,write_array1, sizeof(write_array1));
//	#endif
//	
//}

//void Test_Flash_Read(void)
//{
//	#ifdef USE_WRITE_ARRAY1
//	static uint8_t  read_buffer_test[886];
//	int i = 0;
//	printf("\r\n\r\nread addr 0X%08X   \r\n",FLASH_TEST_ADDR);
//	STMFLASH_Read_NBytes(FLASH_TEST_ADDR,read_buffer_test,sizeof(write_array1) );
//	for(i=0;i < sizeof(write_array1);i++)
//	{
//		printf("0X%02X, ",read_buffer_test[i] );
//		if( (i+1)%16 == 0 )
//			printf("\r\n");
//	}
//	#endif
//}


/*================================================================================*
 *                                 函数声明                                       *
 *================================================================================*/
extern uint16_t STMFLASH_ReadHalfWord ( uint32_t faddr );

/*================================================================================*
 *                                 函数原型                                       *
 *================================================================================*/
 
/*================================================================================*
 * 函数名称:    void AddTestTask()
 * 功能描述:    增加任务
 * 作    者:
 * 输入参数:
 * 输出参数:
 * 返 回 值:
 * 其他说明:
 * 创建历史:
 *
 *================================================================================*/
void AddTestTask(void)
{
    nTestTaskID = AddTask(TestTaskInit, TestTask, TestTaskUninit);
//		printf("AddTestTask !!!nTestTaskID = %d\r\n",nTestTaskID);
}

/*================================================================================*
 * 函数名称:    uint32_t TestTaskInit(void)
 * 功能描述:    任务初始化
 * 作    者:
 * 输入参数:
 * 输出参数:
 * 返 回 值:
 * 其他说明:
 * 创建历史:
 *================================================================================*/
int32_t TestTaskInit(void)
{
    return 0;
}


/*================================================================================*
 * 函数名称:    void TestTask()
 * 功能描述:    
 * 作    者:
 * 输入参数:
 * 输出参数:
 * 返 回 值:
 * 其他说明:    
 * 创建历史:
 *
 *================================================================================*/
extern I2C_HandleTypeDef hi2c1;
uint8_t iic_data[512];
uint16_t bat = 0;	
uint8_t gDMA_OK_flag = 0;

void TestTask(void)
{
//	static uint8_t tempppp[1024];
	uint8_t i = 0;
	static uint32_t nTestTaskTimer = 0;
	if(GET_PASTTICK(nTestTaskTimer)>=1000)
	{
		nTestTaskTimer = GET_CURTICK;
//		printf("test task\r\n");
		//BaseStationGetBatteryPercent();
	}
}

/*================================================================================*
 * 函数名称:    uint32_t TestTaskUninit(void)
 * 功能描述:   
 * 作    者:
 * 输入参数:
 * 输出参数:
 * 返 回 值:
 * 其他说明:
 * 创建历史:
 *
 *================================================================================*/
int32_t TestTaskUninit(void)
{
    return 0;
}

/*================================================================================*
 *                                End of file                                     *
 *================================================================================*/





